burakenez/gd32w51x-cmake-vscode/Examples/I2C/Slave_receiver/Application/Core/Src/system_gd32w51x_f5hc.c
/*!
    \file    system_gd32w51x_f5hc.c
    \brief   CMSIS Cortex-M33 Device Peripheral Access Layer Source File for
             gd32w51x_f5hc Device Series
*/

/*
 * Copyright (c) 2009-2018 Arm Limited. All rights reserved.
 * Copyright (c) 2026, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the CMSIS standard, some adjustments are made according to GigaDevice chips */

#include "gd32w51x_f5hc.h"

#if (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3))
#include "partition_gd32w51x_f5hc.h"
#include "main.h"
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* system frequency define */
#define __IRC16M          (IRC16M_VALUE)            /* internal 16 MHz RC oscillator frequency */
#define __HXTAL           (HXTAL_VALUE)             /* high speed crystal oscillator frequency */
#define __SYS_OSC_CLK     (__IRC16M)                /* main oscillator frequency */
#if defined (GD32F5HC)
#define __IRC48M          (IRC48M_VALUE)            /* internal 48 MHz RC oscillator frequency */
#endif

/* select a system clock by uncommenting the following line */
#if  defined (GD32F5HC)
//#define __SYSTEM_CLOCK_IRC16M                       (uint32_t)(__IRC16M)
//#define __SYSTEM_CLOCK_HXTAL                        (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_IRC48M                       (uint32_t)(__IRC48M)
//#define __SYSTEM_CLOCK_120M_PLLP_IRC16M             (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_120M_PLLP_HXTAL              (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_168M_PLLP_IRC16M             (uint32_t)(168000000)
//#define __SYSTEM_CLOCK_168M_PLLP_HXTAL              (uint32_t)(168000000)
//#define __SYSTEM_CLOCK_180M_PLLP_IRC16M             (uint32_t)(180000000)
//#define __SYSTEM_CLOCK_180M_PLLP_IRC48M             (uint32_t)(180000000)
//#define __SYSTEM_CLOCK_180M_PLLP_HXTAL              (uint32_t)(180000000)
//#define __SYSTEM_CLOCK_200M_PLLP_IRC16M             (uint32_t)(200000000)
//#define __SYSTEM_CLOCK_200M_PLLP_IRC48M             (uint32_t)(200000000)
#define __SYSTEM_CLOCK_200M_PLLP_HXTAL              (uint32_t)(200000000)
#else
//#define __SYSTEM_CLOCK_IRC16M                       (uint32_t)(__IRC16M)
//#define __SYSTEM_CLOCK_HXTAL                        (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_120M_PLLP_IRC16M             (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_120M_PLLP_HXTAL              (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_168M_PLLP_IRC16M             (uint32_t)(168000000)
//#define __SYSTEM_CLOCK_168M_PLLP_HXTAL              (uint32_t)(168000000)
//#define __SYSTEM_CLOCK_180M_PLLP_IRC16M             (uint32_t)(180000000)
#define __SYSTEM_CLOCK_180M_PLLP_HXTAL              (uint32_t)(180000000)
#endif

#define HXTALSTB_DELAY      {                                  \
                                volatile uint32_t i;           \
                                for(i=0U; i<0x2000U; i++){       \
                                }                              \
                            }

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_DE_2(__delay)    do{                                     \
                                        volatile uint32_t i,reg;            \
                                        if(0U != (__delay)){                   \
                                            /* Insert a software delay */   \
                                            for(i=0U; i<(__delay); i++){       \
                                            }                               \
                                            reg = RCU_CFG0;                 \
                                            reg &= ~(RCU_CFG0_AHBPSC);      \
                                            reg |= RCU_AHB_CKSYS_DIV2;      \
                                            /* AHB = SYSCLK/2 */            \
                                            RCU_CFG0 = reg;                 \
                                            /* Insert a software delay */   \
                                            for(i=0U; i<(__delay); i++){       \
                                            }                               \
                                            reg = RCU_CFG0;                 \
                                            reg &= ~(RCU_CFG0_AHBPSC);      \
                                            reg |= RCU_AHB_CKSYS_DIV4;      \
                                            /* AHB = SYSCLK/4 */            \
                                            RCU_CFG0 = reg;                 \
                                            /* Insert a software delay */   \
                                            for(i=0U; i<(__delay); i++){       \
                                            }                               \
                                        }                                   \
                                    }while(0U)

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_UP_1(__delay)    do{                                     \
                                        volatile uint32_t i,reg;            \
                                        if(0U != (__delay)){                \
                                            /* Insert a software delay */   \
                                            for(i=0U; i<(__delay); i++){    \
                                            }                               \
                                            reg = RCU_CFG0;                 \
                                            reg &= ~(RCU_CFG0_AHBPSC);      \
                                            reg |= RCU_AHB_CKSYS_DIV1;      \
                                            RCU_CFG0 = reg;                 \
                                            /* Insert a software delay */   \
                                            for(i=0U; i<(__delay); i++){    \
                                            }                               \
                                        }                                   \
                                    }while(0U)

#define SEL_IRC16M      0x00U
#define SEL_HXTAL       0x01U
#define SEL_PLLP        0x02U
#if defined (GD32F5HC)
#define SEL_IRC48M      0x04U
#else
#define SEL_PLLDIG      0x03U
#endif

