burakenez/gd32w51x-cmake-vscode/Examples/I2C/Slave_receiver/Application/Core/Src/system_gd32w51x_f5hc.c
#if (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)) || SYS_NS
/* set the system clock frequency and declare the system clock configuration function */
#ifdef __SYSTEM_CLOCK_IRC16M
uint32_t SystemCoreClock = __SYSTEM_CLOCK_IRC16M;
static void system_clock_16m_irc16m(void);
#elif defined (__SYSTEM_CLOCK_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_HXTAL;
static void system_clock_hxtal(void);
#elif defined (__SYSTEM_CLOCK_120M_PLLP_IRC16M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_120M_PLLP_IRC16M;
static void system_clock_120m_irc16m(void);
#elif defined (__SYSTEM_CLOCK_120M_PLLP_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_120M_PLLP_HXTAL;
static void system_clock_120m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_168M_PLLP_IRC16M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_168M_PLLP_IRC16M;
static void system_clock_168m_irc16m(void);
#elif defined (__SYSTEM_CLOCK_168M_PLLP_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_168M_PLLP_HXTAL;
static void system_clock_168m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_180M_PLLP_IRC16M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_180M_PLLP_IRC16M;
static void system_clock_180m_irc16m(void);
#elif defined (__SYSTEM_CLOCK_180M_PLLP_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_180M_PLLP_HXTAL;
static void system_clock_180m_hxtal(void);
#elif defined (__SYSTEM_CLOCK_IRC48M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_IRC48M;
static void system_clock_48m_irc48m(void);
#elif defined (__SYSTEM_CLOCK_180M_PLLP_IRC48M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_180M_PLLP_IRC48M;
static void system_clock_180m_irc48m(void);
#elif defined (__SYSTEM_CLOCK_200M_PLLP_IRC16M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_200M_PLLP_IRC16M;
static void system_clock_200m_irc16m(void);
#elif defined (__SYSTEM_CLOCK_200M_PLLP_IRC48M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_200M_PLLP_IRC48M;
static void system_clock_200m_irc48m(void);
#elif defined (__SYSTEM_CLOCK_200M_PLLP_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_200M_PLLP_HXTAL;
static void system_clock_200m_hxtal(void);
#endif /* __SYSTEM_CLOCK_IRC16M */

/* configure the system clock */
static void system_clock_config(void);
static void _soft_delay_(uint32_t time);

/* software delay to prevent the impact of Vcore fluctuations.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
static void _soft_delay_(uint32_t time)
{
    __IO uint32_t i;
    for(i = 0U; i < time * 10U; i++) {
    }
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)  || SYS_NS */
/*!
    \brief      setup the microcontroller system, initialize the system
    \param[in]  none
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void SystemInit(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    /* configure SAU region attributes */
    sau_region_config();
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

#if (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)) || SYS_NS

    /* FPU settings */
#if (__FPU_PRESENT == 1U) && (__FPU_USED == 1U)
    SCB->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2)); /* set CP10 and CP11 Full Access */

#if (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3))
    SCB_NS->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2)); /* set CP10 and CP11 Full Access */
#endif /* (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)) */

#endif

    /* reset the RCU clock configuration to the default reset state */
    /* set IRC16MEN bit */
    RCU_CTL |= RCU_CTL_IRC16MEN;

#if defined (GD32F5HC)
    while(0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
    }
    if(RCU_SCSS_PLLP == (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
        RCU_MODIFY_DE_2(0x50U);
    }
#else
    while(0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
    }
    if(RCU_SCSS_PLLP == (RCU_CFG0 & RCU_CFG0_SCSS)) {
        RCU_MODIFY_DE_2(0x50U);
    }
#endif
    _soft_delay_(200U);
    /* reset RCU_CTL register */
#if defined (GD32F5HC)
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN | RCU_CTL_RCUPRIP);
    RCU_CTL &= ~(RCU_CTL_PLLI2SEN | RCU_CTL_IRC48MEN);
    /* reset PLLCFG register */
    RCU_PLLCFG = 0x00041400U;
#else
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN | RCU_CTL_PLLDIGEN | RCU_CTL_RFCKMEN | RCU_CTL_RCUPRIP);
    RCU_CTL &= ~(RCU_CTL_HXTALENPLL);
    RCU_CTL &= ~(RCU_CTL_PLLI2SEN | RCU_CTL_PLLDIGPU);
    RCU_CTL &= ~(RCU_CTL_HXTALENI2S);
    RCU_CTL &= ~(RCU_CTL_HXTALPU | RCU_CTL_HXTALREADY);
    RCU_CTL |= RCU_CTL_HXTALBPS;
    /* reset PLLCFG register */
    RCU_PLLCFG = 0x03000000U;
    RCU_CTL |= RCU_CTL_HXTALBPS;
#endif

    /* reset CFG0 register */
    RCU_CFG0 = 0x00009400U;
    /* reset CFG1 register */
    RCU_CFG1 = 0x00000000U;
    /* reset ADDCTL register */
    RCU_ADDCTL = 0x00000000U;
    /* reset PLL register */
    RCU_PLL = 0x00003010U;
    /* disable all interrupts */
    RCU_INT = 0x00000000U;

    /* configure the system clock source, PLL multiplier and divider factors,
       AHB/APBx prescalers and flash settings */
    system_clock_config();
    /* enable ICACHE */
    ICACHE_CTL |= ICACHE_CTL_EN;
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)  || SYS_NS */
}
/*!
    \brief      configure the system clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
#if (defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)) || SYS_NS
static void system_clock_config(void)
{
#ifdef __SYSTEM_CLOCK_IRC16M
    system_clock_16m_irc16m();
#elif defined (__SYSTEM_CLOCK_HXTAL)
    system_clock_hxtal();
#elif defined (__SYSTEM_CLOCK_120M_PLLP_IRC16M)
    system_clock_120m_irc16m();
#elif defined (__SYSTEM_CLOCK_120M_PLLP_HXTAL)
    system_clock_120m_hxtal();
#elif defined (__SYSTEM_CLOCK_168M_PLLP_IRC16M)
    system_clock_168m_irc16m();
#elif defined (__SYSTEM_CLOCK_168M_PLLP_HXTAL)
    system_clock_168m_hxtal();
#elif defined (__SYSTEM_CLOCK_180M_PLLP_IRC16M)
    system_clock_180m_irc16m();
#elif defined (__SYSTEM_CLOCK_180M_PLLP_HXTAL)
    system_clock_180m_hxtal();
#elif defined (__SYSTEM_CLOCK_IRC48M)
    system_clock_48m_irc48m();
#elif defined (__SYSTEM_CLOCK_180M_PLLP_IRC48M)
    system_clock_180m_irc48m();
#elif defined (__SYSTEM_CLOCK_200M_PLLP_IRC16M)
    system_clock_200m_irc16m();
#elif defined (__SYSTEM_CLOCK_200M_PLLP_IRC48M)
    system_clock_200m_irc48m();
#elif defined (__SYSTEM_CLOCK_200M_PLLP_HXTAL)
    system_clock_200m_hxtal();
#endif /* __SYSTEM_CLOCK_IRC16M */
}

#ifdef __SYSTEM_CLOCK_IRC16M
/*!
    \brief      configure the system clock to 16M by IRC16M
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_16m_irc16m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;

    /* enable IRC16M */
    RCU_CTL |= RCU_CTL_IRC16MEN;

    /* wait until IRC16M is stable or the startup time is longer than IRC16M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC16MSTB);
    } while((0U == stab_flag) && (IRC16M_STARTUP_TIMEOUT != timeout));

