burakenez/gd32w51x-cmake-vscode/Examples/I2C/Slave_receiver/Application/Core/Src/system_gd32w51x_f5hc.c
    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
        while(1) {
        }
    }
    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV1;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

#if defined (GD32F5HC)
    /* select IRC16M as system clock */
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    RCU_CFG0 |= RCU_CKSYSSRC_IRC16M;

    /* wait until IRC16M is selected as system clock */
    while(RCU_SCSS_IRC16M != (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
    }
#else
    /* select IRC16M as system clock */
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    RCU_CFG0 |= RCU_CKSYSSRC_IRC16M;

    /* wait until IRC16M is selected as system clock */
    while(RCU_SCSS_IRC16M != (RCU_CFG0 & RCU_CFG0_SCSS)) {
    }
#endif
}

#elif defined (__SYSTEM_CLOCK_IRC48M)
/*!
    \brief      configure the system clock to 48M by IRC48M
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_48m_irc48m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;
    __IO uint32_t reg_temp;

    /* enable IRC48M */
    RCU_CTL |= RCU_CTL_IRC48MEN;

    /* wait until IRC48M is stable or the startup time is longer than IRC48M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC48MSTB);
    } while((0U == stab_flag) && (IRC48M_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC48MSTB)) {
        while(1) {
        }
    }
    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV1;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    reg_temp = RCU_CFG0;
    /* select IRC48M as system clock */
    reg_temp &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    reg_temp |= RCU_CKSYSSRC_IRC48M;
    RCU_CFG0 = reg_temp;

    /* wait until IRC48M is selected as system clock */
    while(RCU_SCSS_IRC48M != (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
    }
}

#elif defined (__SYSTEM_CLOCK_HXTAL)
/*!
    \brief      configure the system clock to HXTAL
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_hxtal(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;
    __IO uint32_t reg_temp;

#if defined (GD32F5HC)
    /* enable HXTAL */
    RCU_CTL |= RCU_CTL_HXTALEN;
#else
    /* power up the HXTAL */
    RCU_CTL |= RCU_CTL_HXTALPU;
    /* enable HXTAL */
    RCU_CTL |= RCU_CTL_HXTALEN;
    RCU_CTL |= RCU_CTL_HXTALENPLL;
    HXTALSTB_DELAY
    RCU_CTL |= RCU_CTL_HXTALREADY;
#endif

    /* wait until HXTAL is stable or the startup time is longer than HXTAL_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
    } while((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_HXTALSTB)) {
        while(1) {
        }
    }
    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB/2 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

#if defined (GD32F5HC)
    reg_temp = RCU_CFG0;
    /* select HXTAL as system clock */
    reg_temp &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    reg_temp |= RCU_CKSYSSRC_HXTAL;
    RCU_CFG0 = reg_temp;

    /* wait until HXTAL is selected as system clock */
    while(RCU_SCSS_HXTAL != (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
    }
#else
    reg_temp = RCU_CFG0;
    /* select HXTAL as system clock */
    reg_temp &= ~RCU_CFG0_SCS;
    reg_temp |= RCU_CKSYSSRC_HXTAL;
    RCU_CFG0 = reg_temp;

    /* wait until HXTAL is selected as system clock */
    while(RCU_SCSS_HXTAL != (RCU_CFG0 & RCU_CFG0_SCSS)) {
    }
#endif
}

#elif defined (__SYSTEM_CLOCK_120M_PLLP_IRC16M)
/*!
    \brief      configure the system clock to 120M by PLL which selects IRC16M as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_120m_irc16m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;
    __IO uint32_t reg_temp;

    /* enable IRC16M */
    RCU_CTL |= RCU_CTL_IRC16MEN;

    /* wait until IRC16M is stable or the startup time is longer than IRC16M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC16MSTB);
    } while((0U == stab_flag) && (IRC16M_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
        while(1) {
        }
    }

    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* IRC16M is stable */
    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

#if  defined (GD32F5HC)
    /* AHB = SYSCLK/2. AHB clock will be modified to SYSCLK after frequency switching finished to prevent Vcore fluctuations */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV2;
#else
    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
#endif
    /* APB2 = AHB/2 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    /* configure the main PLL, PSC = 16, PLL_N = 240, PLL_P = 2 */
    RCU_PLL = (16U | (240U << 6U) | (((2U >> 1U) - 1U) << 16U) |
               (RCU_PLLSRC_IRC16M));

