burakenez/gd32w51x-cmake-vscode/Examples/I2C/Slave_receiver/Application/Core/Src/system_gd32w51x_f5hc.c
    /* enable IRC48M */
    RCU_CTL |= RCU_CTL_IRC48MEN;

    /* wait until IRC48M is stable or the startup time is longer than IRC48M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC48MSTB);
    } while((0U == stab_flag) && (IRC48M_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC48MSTB)) {
        while(1) {
        }
    }

    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* IRC48M is stable */
    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

#if  defined (GD32F5HC)
    /* AHB = SYSCLK/2. AHB clock will be modified to SYSCLK after frequency switching finished to prevent Vcore fluctuations */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV2;
#else
    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
#endif
    /* APB2 = AHB/2 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    /* configure the main PLL, PSC = 48, PLL_N = 360, PLL_P = 2 */
    RCU_PLL = (48U | (360U << 6U) | (((2U >> 1U) - 1U) << 16U) |
               (RCU_PLLSRC_IRC48M));

    /* enable PLL */
    RCU_CTL |= RCU_CTL_PLLEN;

    /* wait until PLL is stable */
    while(0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
    }
    reg_temp = RCU_CFG0;
    /* select PLL as system clock */
    reg_temp &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    reg_temp |= RCU_CKSYSSRC_PLLP;
    RCU_CFG0 = reg_temp;

    /* wait until PLL is selected as system clock */
    while(RCU_SCSS_PLLP != (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
    }

#if  defined (GD32F5HC)
    /* modify AHB clock to SYSCLK */
    RCU_MODIFY_UP_1(0x50U);
#endif
}

#elif defined (__SYSTEM_CLOCK_200M_PLLP_IRC48M)
/*!
    \brief      configure the system clock to 200M by PLL which selects IRC48M as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_200m_irc48m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;
    __IO uint32_t reg_temp;

    /* enable IRC48M */
    RCU_CTL |= RCU_CTL_IRC48MEN;

    /* wait until IRC48M is stable or the startup time is longer than IRC48M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC48MSTB);
    } while((0U == stab_flag) && (IRC48M_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC48MSTB)) {
        while(1) {
        }
    }

    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL0 |= PMU_CTL0_LDOVS;

    /* IRC48M is stable */
    /* reset the RCU_CFG0 AHBPSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_AHBPSC;
    /* reset the RCU_CFG0 APB1PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB1PSC;
    /* reset the RCU_CFG0 APB2PSC bits */
    RCU_CFG0 &= ~ RCU_CFG0_APB2PSC;

    /* AHB = SYSCLK/2. AHB clock will be modified to SYSCLK after frequency switching finished to prevent Vcore fluctuations */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV2;
    /* APB2 = AHB/2 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    /* configure the main PLL, PSC = 48, PLL_N = 400, PLL_P = 2 */
    RCU_PLL = (48U | (400U << 6U) | (((2U >> 1U) - 1U) << 16U) |
               (RCU_PLLSRC_IRC48M));

    /* enable PLL */
    RCU_CTL |= RCU_CTL_PLLEN;

    /* wait until PLL is stable */
    while(0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
    }
    reg_temp = RCU_CFG0;
    /* select PLL as system clock */
    reg_temp &= ~(RCU_CFG0_SCS | RCU_CFG0_SCS_1);
    reg_temp |= RCU_CKSYSSRC_PLLP;
    RCU_CFG0 = reg_temp;

    /* wait until PLL is selected as system clock */
    while(RCU_SCSS_PLLP != (RCU_CFG0 & (RCU_CFG0_SCSS | RCU_CFG0_SCSS_1))) {
    }

    /* modify AHB clock to SYSCLK */
    RCU_MODIFY_UP_1(0x50U);
}
#endif /* __SYSTEM_CLOCK_IRC16M */

/*!
    \brief      update the SystemCoreClock with current core clock retrieved from cpu registers
    \param[in]  none
    \param[out] none
    \retval     none
*/
void SystemCoreClockUpdate(void)
{
    uint32_t sws;
    uint32_t pllpsc, plln, pllsel, pllp, ck_src, idx, clk_exp;

    /* exponent of AHB, APB1 and APB2 clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws) {
    /* IRC16M is selected as CK_SYS */
    case SEL_IRC16M:
        SystemCoreClock = IRC16M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        SystemCoreClock = HXTAL_VALUE;
        break;
#if defined (GD32F5HC)
    /* IRC48M is selected as CK_SYS */
    case SEL_IRC48M:
        SystemCoreClock = IRC48M_VALUE;
        break;
#endif
    /* PLLP is selected as CK_SYS */
    case SEL_PLLP:
        /* get the value of PLLPSC[5:0] */
        pllpsc = GET_BITS(RCU_PLL, 0U, 5U);
        plln = GET_BITS(RCU_PLL, 6U, 14U);
        pllp = (GET_BITS(RCU_PLL, 16U, 17U) + 1U) * 2U;
#if defined (GD32F5HC)
        /* PLL clock source selection, HXTAL or IRC16M */
        pllsel = (RCU_PLL & (RCU_PLL_PLLSEL | RCU_PLL_PLLSEL_1));
        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC16M == pllsel) {
            ck_src = IRC16M_VALUE;
        } else {
            ck_src = IRC48M_VALUE;
        }
#else
        /* PLL clock source selection, HXTAL or IRC16M */
        pllsel = (RCU_PLL & RCU_PLL_PLLSEL);
        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else {
            ck_src = IRC16M_VALUE;
        }
#endif
        SystemCoreClock = ((ck_src / pllpsc) * plln) / pllp;
        break;
    /* IRC16M is selected as CK_SYS */
    default:
        SystemCoreClock = IRC16M_VALUE;
        break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    SystemCoreClock = SystemCoreClock >> clk_exp;
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)  || SYS_NS */

#ifdef __FIRMWARE_VERSION_DEFINE
/*!
    \brief      get firmware version
    \param[in]  none
    \param[out] none
    \retval     firmware version
*/
uint32_t gd32w51x_f5hc_firmware_version_get(void)
{
    return (uint32_t)__gd32w51x_f5hc_STDPERIPH_VERSION;
}
#endif /* __FIRMWARE_VERSION_DEFINE */

